// JavaScript Document

prompt("Was schaust du mich so blöd an?",23);

alert('Hello World! 1');
//alert('Hello World! 2');
//alert('Hello World! 3');

//alert(9+2); //Произойдет вычеслительная операция с заданными числами и на выходе получим: 11
//alert('9'+'2'); //Произойдет конкатенация строковых элементов и получим на выводе 92

//var string = 'Servusle!!!';

//alert(string);

//var user = 'Martin', age = 29, message = 'Leck mich am Arsch!!!';

//alert('Name is: ' + user + ' , age is:  ' + age + ' e moi message est:    ' + message );
//
//alert(5 - '2'); //арифмитический оператор приводит наш аргумент к числу!!!
//alert('5' - 1); //арифмитический оператор приводит наш аргумент к числу!!!
//alert('5' / '2'); //арифмитический оператор приводит наш аргумент к числу!!!

//Присваивание значения по цепочке:

//var a,b,c;

//a=b=c=2*7;

//alert(a);//Выведет 14
//alert(b);//Выведет 14
//alert(c);//Выведет 14

//Взятие остатка (деление по модулю: %):

//alert(8%3);//Выведет 2 - остаток от деления

//Деление времени инкрименту(увеличивает на единицу: ++) и дикрименту(уменьшает на единицу: --):
//var i = 5;
//i++;
//alert(i);//Выведет 6


//var n = 2;
//n+=2;//Добавляет к себе 2 и сохраняет 4
//n*=5//Умножает себя на 5 и уже получится 20
//alert(n);//


//Запятая имеет низший приоритет чем оператор присваивания. Поэтому берем в скобки несколько чисел и выведется последнее после последней запятой число:

//var a = (2,5,7);
//alert(a);//выведет 7

//prompt("Was schaust du mich so blöd an?", 23);

//"Will dich einfach in den Arsch tretten!!!:-)"
//"Was schaust du mich so blöd an?"